Documents/ТоварКиримДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТоварКиримДокумент</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварларРегистрыНакопления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЖамиСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Руйхат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТоварНоми</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварларСправочники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сони</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нархи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Суммаси</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ТоварКиримДокумент/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Функция РасчетСумма();
	ТС = Элементы.Руйхат.ТекущиеДанные;
	ТС.Суммаси = ТС.Сони * ТС.Нархи;
	
	ЖамиСумма = 0;
	Для Каждого Строка Из Объект.Руйхат Цикл
		ЖамиСумма = ЖамиСумма + Строка.Суммаси;
	КонецЦикла;
	
	Объект.ЖамиСумма = ЖамиСумма;
КонецФункции // ()


&НаКлиенте
Процедура РуйхатСониПриИзменении(Элемент)
	РасчетСумма();	
КонецПроцедуры


&НаКлиенте
Процедура РуйхатНархиПриИзменении(Элемент)
	РасчетСумма();
КонецПроцедуры
